[
  {
    "path": "posts/2021-07-11-eci-511-week-2-review/",
    "title": "ECI 511 – Week 2 Review",
    "description": "Week 2 introduced us to the leadership dimension of learning design.",
    "author": [
      {
        "name": "James Hardaway",
        "url": "https://scholar.google.com/citations?user=su16JUQAAAAJ&hl=en&authuser=1"
      }
    ],
    "date": "2021-07-11",
    "categories": [
      "ECI511",
      "NC State",
      "behaviors",
      "Camtasia",
      "leadership",
      "mindset",
      "Sheninger",
      "skills",
      "video",
      "Zoom"
    ],
    "contents": "\n\nContents\nReading/Videos\nAssignments\n\nReading/Videos\nThis week’s readings introduced us to the Leadership domain of the LDT program. The focus was on how to develop and implement a vision for integrating technology into an organization’s education or training and development program. We watched quite a few videos that, along with the reading, explained the challenges organizations faced when trying to transition to a more digital footprint for learning. The detractors usually came in one of three areas: mindset, skills, or behaviors. For an organization to effectively adopt a new operating model, such as digital learning, the people need to be ready for this change. Buy-in matters. Leadership should endeavor to ensure the workforce understands how the organization will improve with these changes. If a person doesn’t understand how the changes will make their job easier or more productive, they will fight learning any new skills during the transition. Another limiting factor is often individual skills. Especially for an older workforce that my not have grown up digital, learning tech skills can be intimidating. As part of the transition, leadership should plan for and resource training modules to ensure everyone can comfortably employ the new digital tools. And finally, leadership sets the example by modeling behaviors that reinforce the advantages of adopting new technology. Leaders must use the tools, whether its email calendars or a new project management system, if they expect the workforce to do the same. The goal should be for the technology to become a seamless part of effective operations, and not have your day-to-day tasks be driven by the capability of the tech.\n\n One of the better readings this week was an article on the Pillars of Digital Leadership, penned by Eric Sheninger. The article captured seven insights he took from transitioning his high school to a more digital learning environment. I liked the article so much, I grabbed a copy of his book, Digital Leadership: Changing Paradigms for Changing Times, which explains in greater detail how he was able to change the technology culture in his school.\n\nAssignments\n\n Our assignment this week was to create a short online professional training video. Camtasia was referenced as a tool used throughout the learning design community, so I invested in the software for this project. The price was very manageable and there is a good Mac version, which was great as that’s my OS of choice. Additionally, numerous sites exist that have short, but effective, instructional videos on how to use the software if you get stuck. For the assignment, I chose to create a video on building breakout rooms in Zoom. You can find my final version here. The video had to be at least 10 minutes in length, so that became my target. While the project wasn’t too complicated, it does take a bit of practice and trial & error to effectively use the highlighting tools while making the video. I got to work with employing transitions as well. In the end, it was probably ~4 hours of work to make a 10-minute video. Much of that was due to me learning the software and how my mic/speakers impacted the quality of the video. I built an outline and script for my speaking parts, which allowed me to focus most of my rehearsals on ensuring my voice matched with my on-screen walkthrough. While I won’t be winning any Academy Awards in the near future, I liked the final product. The key, though, was it showed me that content development/design is probably NOT my dream job. While it was fun to explore the software and see the final video in action, there was way too much detailed work and editing for just 10 minutes of product. But, I do have confidence now that I can do this when/if the need arises down the road.\n\nNext week? We talk design. See you soon!\n\n\n\n",
    "preview": "posts/2021-07-11-eci-511-week-2-review/camtasia.png",
    "last_modified": "2021-12-31T11:36:47-05:00",
    "input_file": {},
    "preview_width": 650,
    "preview_height": 652
  },
  {
    "path": "posts/2021-07-04-eci-511-week-1-review/",
    "title": "ECI 511 – Week 1 Review",
    "description": "Week 1 gave us an opportunity to meet the class and served as an introduction to the field of learning design and technology.",
    "author": [
      {
        "name": "James Hardaway",
        "url": "https://scholar.google.com/citations?user=su16JUQAAAAJ&hl=en&authuser=1"
      }
    ],
    "date": "2021-07-04",
    "categories": [
      "ECI511",
      "NC State",
      "government",
      "history",
      "industry",
      "military",
      "portfolio",
      "revolution",
      "webpage",
      "design",
      "inquiry",
      "leadership"
    ],
    "contents": "\n\nContents\nReading/Videos\nDiscussion\nAssignments\n\nFor my intro to the Learning Design & Technology (LDT) program, I’m taking one 5-week summer class before going full time in the fall. ECI 511, Intro to LDT, is the recommended first course for the program and for good reason. The compressed schedule is designed to give a thorough, but quick, overview of the 3 core disciplines within the field of LDT: Leadership, Design, and Digital Inquiry. Here in week 1, we focused on how the LDT field has been established historically mainly driven by the technological revolution.\nReading/Videos\nThe class material has a good mix of articles and videos to introduce us to how the field has evolved over the past 100 years. There is a major assignment each week and for this first week, my assignment was to establish this portfolio website. The intent is for me to use this portal to chart my progress through the program, displaying my work as well as what I’m learning by doing the work. The end state is to have a portfolio showing my progress in becoming a learning designer that could potentially be used as a launching point for my life after the program. Through this week’s class material, my key insights are below:\nTech changes to education came from outside the school house (government, military, industry)\nThe speed of tech evolution (capability/capacity) is always under-valued/appreciated\nTech’s ability to “revolutionize” learning has always been over-emphasized\nEducational institutions are generally slow to adopt new technology/methods\nHistorically, tech’s impact to learning has been on the margins (pencils/paper/blackboards becoming digitized), but we have yet to see a “revolution” in how we teach/learn.\nDiscussion\nFor our first discussion topic, each student was asked to provide an introduction and photo so we can better visualize who we’ll be working with this semester. The introduction should Include current job role, goal or rationale for entering the Learning, Design, and Technology master’s program, and interests in the field. Finally, after perusing this week’s readings, we were asked to craft a personal definition of the instructional technology/instructional design field. The goal is to see how much our perceptions and or knowledge of the field change throughout the course, and we will have an opportunity to revisit the definition at the end of the semester to correct any misconceptions. Below is my intro to the class:\n\n Hello, fellow Wolfpackers! My name is James Hardaway and I’m new to the education and learning design field. I’m returning to NCSU after a bit of a detour as an Army officer. I will retire this week, so it’s fitting to come back to my roots as my military career began here with my graduation and commissioning back in 1994. I’ve spent 27 years as an Army intelligence officer, so I’m versed in data-driven analysis, critical thinking, and leadership development. My goal in the LD&T master’s program is to explore how digital learning tools can assist in discovering how students receive instruction and learn. I’m a parent of a high school senior who is in his 10th school. To say we’ve seen a wide variety of teaching methodologies is a huge understatement. These experiences have highlighted a gap (at least in public education) in how to determine a student’s learning path to best maximize outcomes for the individual. I want to play a role in developing tools (software/hardware) and designing curricula that bridge this gap.\nTo me, the instructional technology/instructional design field combines advances in multi-media educational instruments/aids with various teaching modalities to improve the learning experience.\n\nAssignments\n\n Our first graded assignment is to create a website framework that we’ll be using for our digital program portfolio. The guidelines are fairly broad and allow us to use any tools we’re confident can enable us to build a site that demonstrates the skills and abilities we’ve acquired throughout the program. The completed portfolio will be submitted as part of ECI 652, our final course. I have some experience with WordPress and building websites, so I began there. For this initial assignment, we are only required to develop the basic structure for the online portfolio. That effort resides here. I’m sure this site will evolve often and look much different by the time I complete the program.\n\n\n\n\n",
    "preview": "posts/2021-07-04-eci-511-week-1-review/james_mug_sm.jpg",
    "last_modified": "2021-12-31T11:36:27-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-01-welcome-back/",
    "title": "Welcome Back!",
    "description": "Great to be back in the Red & White of NC State!",
    "author": [
      {
        "name": "James Hardaway",
        "url": "https://scholar.google.com/citations?user=su16JUQAAAAJ&hl=en&authuser=1"
      }
    ],
    "date": "2021-07-01",
    "categories": [
      "ECI511",
      "NC State"
    ],
    "contents": "\n\n Thanks for stopping by my little corner of the web. This portfolio site is being built as part of a class requirement for the masters program I am just now beginning at NC State. Over the next 2 years or so, I will use this landing spot to drop insights and artifacts from my journey through Learning Design & Technology studies at the NCSU College of Education. Wish me luck!!\n\n\n\n\n",
    "preview": "posts/2021-07-01-welcome-back/ncstate-brick-2x2-red-rgb.jpeg",
    "last_modified": "2021-12-31T11:36:06-05:00",
    "input_file": {}
  }
]
